app/controllers/api/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "birthday", "gender", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

        def update
            @user = User.find(params[:id])
            if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "users" SET "bio" = $1, "work" = $2, "education" = $3, "current_city" = $4, "hometown" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["bio", ""], ["work", ""], ["education", ""], ["current_city", ""], ["hometown", ""], ["updated_at", "2021-02-19 01:10:33.980907"], ["id", 16]]